app/controllers/admin/articles_controller.rb

  def create
    @article = Article.new(params[:article])

    respond_to do |format|
      if @article.save
---
INSERT INTO "articles" ("content", "created_at", "published", "shortUrl", "slug", "tags", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @article = Article.find(params[:id])

    respond_to do |format|
      if @article.update_attributes(params[:article])
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "articles" SET "title" = 'nthaoeuoeuoeuoaeuoaeuoe', "content" = 'aoeuoeuueaoeue', "updated_at" = '2012-06-24 06:32:56.729108' WHERE "articles"."id" = 6