app/controllers/articles_controller.rb

SELECT "tags".* FROM "tags" WHERE "tags"."name" = 'tags' LIMIT 1
---
  def tags
    @articles = Tag.find_by_name(params[:tag]).articles